---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
source: html/d6859206-10ee-9570-a1a8-98a68f3e1fd9.htm
---
# Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs

The event arguments used by the DocumentSynchronizingWithCentralEventArgs event.

## Syntax (C#)
```csharp
public class DocumentSynchronizingWithCentralEventArgs : RevitAPIPreDocEventArgs
```